Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བུད་མེད་དེས་ཁང་པ་བརྩེགས་པ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་སོ།
en: Then indeed the woman dedicated that towering mansion to unsurpassed, complete enlightenment, making common cause with all beings.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བུད་མེད་དེའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས། དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ།
en: At that time the Blessed One understood the aspiration of that woman and smiled, indicative of the true nature of the lord buddhas.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་གཟེར་ཁ་དོག་སྣ་ཚོགས་རྣམ་པ་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་སེར་པོ་དང་དམར་པོ་དང་དཀར་པོ་དང་། ལེབ་རྒན་དང་ཤེལ་དང་དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་འཐོན་པར་གྱུར་ནས།
en: When he smiled, many multicolored rays of light were diffused from the Blessed One’s mouth—blue, yellow, red, white, scarlet, crystal, and silver.

source: དེ་དག་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དོང་སྟེ་ཕྱིར་འོངས་ནས། བཅོམ་ལྡན་འདས་ལ་གཡས་ཕྱོགས་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ།
en: They extended through infinite and limitless world systems, and then returned, circumambulating the Blessed One clockwise three times before vanishing into the crown of the Blessed One’s head.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོས་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བས་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཛུམ་པ་མི་མཛད་ན། ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་འཛུམ་པ་མཛད། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then the venerable Ānanda, with his upper robe over one shoulder, rested his right knee on the ground and, placing his hands together in the gesture of homage, bowed toward the place where the Blessed One was, saying, “Blessed Lord, since the Tathāgata, Arhat, completely awakened Buddha does not smile without a cause and without conditions, what is the cause and what are the conditions that gave rise to your smile?” “

source: དགའ་བོ་གང་གཱའི་ལྷ་མོ་ཞེས་བྱ་བའི་སྲིང་མོ་འདི་མ་འོངས་པའི་དུས་ན། དཔེ་སྐར་མ་ལྟ་བུ་ཞེས་བྱ་བའི་བསྐལ་པ་ལ། གསེར་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: Ānanda,” replied the Blessed One, “this sister named Gaṅgadevī will in the future, in the eon called Tārakopama, appear in the world as the tathāgata, arhat, completely awakened buddha named Suvarṇapuṣpa.

source: །དགའ་བོ་འདི་ནི་བུད་མེད་ཀྱི་ལུས་ཀྱི་ཐ་མ་ཡིན་ཏེ།
en: Ānanda, this is her last birth in a female form.

source: དགའ་བོ་སྲིང་མོ་འདི་བུད་མེད་ཀྱི་ལུས་རྗེས་ཏེ། སྐྱེས་པའི་ལུས་ཐོབ་པར་གྱུར་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་སྒུལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་མངོན་པར་དགའ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེས་ཏེ།
en: Ānanda, this sister, after this present female form has expired, will acquire a male form and take birth in the realm of Abhirati, the buddhafield of the tathāgata, arhat, completely awakened Buddha Akṣobhya.

source: དེར་ཚངས་པའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་རོ།
en: There he will be chaste in conduct.

source: །དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་མིང་ཡང་གསེར་གྱི་མེ་ཏོག་ཅེས་བྱ་བར་འགྱུར་རོ།
en: Ānanda, the name of that bodhisattva great being will also be Suvarṇapuṣpa. {Ki.

source: །དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསེར་གྱི་མེ་ཏོག་དེ་ནས་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་མི་འབྲལ་བར་འགྱུར་རོ།
en: IV: 191} Ānanda, when that bodhisattva great being Suvarṇapuṣpa has died and transmigrated, he will proceed from buddhafield to buddhafield, and he will never be separated from the lord buddhas.

source: །དགའ་བོ་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཁང་པ་ནས་ཁང་པར་འགྲོ་ཡང་། དེ་ནམ་འཚོ་བ་དང་ནམ་འཆི་བའི་དུས་ཀྱི་བར་དུ་རྐང་པའི་མཐིལ་གཉིས་ཀྱིས་ས་ལ་མི་འགྲོའོ། །དགའ་བོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསེར་གྱི་མེ་ཏོག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་གྱི་བར་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་རོ།
en: Ānanda, just as a universal monarch may move from palace to palace, without his two feet touching the ground while he is alive, until the time of his death, in the same way, Ānanda, the bodhisattva great being Suvarṇapuṣpa will also proceed from buddhafield to buddhafield, until he has attained consummate buddhahood in unsurpassed, complete enlightenment.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་སྙེད་ཅིག་འདུས་པར་འགྱུར་བ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་ཚོགས་སུ་བལྟའོ་སྙམ་པ་དང་།
en: Then the venerable Ānanda thought, “All the bodhisattva great beings, as many as there are gathered in that buddhafield, should be regarded as a congregation of tathāgatas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགའ་བོའི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཐུགས་སུ་ཆུད་ནས། ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགའ་བོ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One, comprehending the thoughts in the mind of the venerable Ānanda, said to the venerable Ānanda, “Ānanda, it is so!

source: ཇི་ལྟར་ཡོངས་སུ་རྟོག་པ་དེ་བཞིན་ནོ།
en: It is just as you have thought.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་གྱི་མེ་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་སྙེད་ཅིག་འདུ་བར་འགྱུར་བ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་འདུས་པར་བལྟ་སྟེ།
en: All the bodhisattva great beings, as many as there are gathered in the buddhafield of the tathāgata, arhat, completely awakened Buddha Suvarṇapuṣpa, should be regarded as a congregation of tathāgatas.

source: དེའི་དགེ་སློང་གི་དགེ་འདུན་ཡང་ཚད་ཟིན་པར་མི་འགྱུར་རོ། །དེའི་དགེ་སློང་གི་དགེ་འདུན་ལ་ཉན་ཐོས་བརྒྱ་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ། །ཉན་ཐོས་སྟོང་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ། །ཉན་ཐོས་བརྒྱ་སྟོང་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ།
en: His community of monks will also be immeasurable.

source: །ཉན་ཐོས་བྱེ་བ་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ། །ཉན་ཐོས་བྱེ་བ་བརྒྱ་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ། །ཉན་ཐོས་བྱེ་བ་སྟོང་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ། །ཉན་ཐོས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ། །ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་ནི་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་དགེ་སློང་གི་དགེ་འདུན་དེའི་ཚད་གཟུང་བར་མི་ནུས་ཏེ།
en: It will be impossible to grasp the extent of his community of monks by saying, [for example], that there are so many hundreds of śrāvakas in his community of monks, or that there are so many thousands of śrāvakas in his community of monks, or that there are so many hundred thousands of śrāvakas in his community of monks, or that there are so many tens of millions of śrāvakas in his community of monks, or that there are so many billions of śrāvakas in his community of monks, or that there are so many tens of billions of śrāvakas in his community of monks, or that there are so many trillions of śrāvakas in his community of monks, or that there are so many million trillions of śrāvakas in his community of monks.

source: གཞན་དུ་ན་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གྲངས་མེད་གཞལ་དུ་མེད་པར་འགྱུར་རོ།
en: Rather, they will number countless, incalculably many hundred trillions of trillions.

source: །དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་གྱི་མེ་ཏོག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་བསྟན་པའི་སྐྱོན་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་མི་སྲིད་དོ།
en: Ānanda, in that buddhafield where the tathāgata, arhat, completely awakened Buddha Suvarṇapuṣpa will attain consummate buddhahood in unsurpassed, complete enlightenment, all the faults that are taught about in this Perfection of Wisdom will not arise and they will be nonexistent.”

source: །དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་སྲིང་མོ་འདིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཞིག་ལ་མཆོད་པ་བགྱིས་ནས་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ་སླར་མྱི་ལྡོག་པའི་སེམས་བསྐྱེད་པར་འགྱུར།
en: Ānanda then asked, “Blessed Lord, in the presence of which tathāgata, arhat, completely awakened buddha did this sister make offerings, cultivating the roots of virtuous action and setting her mind on irreversible [enlightenment]?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བོ་སྲིང་མོ་འདིས་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་དྲུང་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Ānanda,” replied the Blessed One, “this sister cultivated the roots of virtuous action in the presence of the tathāgata, arhat, completely awakened Buddha Dīpaṃkara, and set her mind upon unsurpassed, complete enlightenment.

source: དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་སོ།
en: She indeed dedicated those roots of virtuous action to unsurpassed, complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དེ་ལ་ཡང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར། གསེར་གྱི་མེ་ཏོག་ཉིད་ཀྱིས་གཏོར་ཏོ།
en: To strive for unsurpassed, complete enlightenment she also cast these same golden flowers upon the tathāgata, arhat, completely awakened Buddha Dīpaṃkara.

source: །དགའ་བོ་ངས་གང་གི་ཚེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལ་ཨུཏྤལ་ལྔ་གཏོར་བ་དེའི་ཚེ།
en: Ānanda, at the time when I cast five blue lotuses toward the tathāgata, arhat, completely awakened Buddha Dīpaṃkara in order to strive for unsurpassed, complete enlightenment, {Ki.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དེས་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་མཁྱེན་ནས། ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: IV: 192} the tathāgata, arhat, completely awakened Buddha Dīpaṃkara knew that I had acquired the roots of virtuous action, and prophesied that I would attain unsurpassed, complete enlightenment.

source: །དེའི་ཚེ་སྲིང་མོ་འདིས་ང་ལུང་བསྟན་པ་དེ་ཐོས་ནས་འདི་སྙམ་དུ་བདག་ཀྱང་ཇི་ལྟར་བྲམ་ཟེའི་བུ་འདི་ལུང་བསྟན་པ་དེ་བཞིན་དུ་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་གྱུར་ཅིག་ཅེས་སེམས་བསྐྱེད་དེ།
en: At that time, this sister also heard the prophetic declaration concerning me and set her mind upon [enlightenment], thinking, ‘Just as it has been prophesied of this brahmin child, may I too in the future be prophesied to attain unsurpassed, complete enlightenment!’

source: དགའ་བོ་དེ་ལྟར་སྲིང་མོ་འདིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་དྲུང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་དང་པོ་བསྐྱེད་དོ། །དགའ་བོས་གསོལ་པ།
en: Ānanda, so it was that this sister initially set her mind on unsurpassed, complete enlightenment in the presence of that tathāgata, arhat, completely awakened buddha.” “

source: བཅོམ་ལྡན་འདས་སྲིང་མོ་འདིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དོན་དུ་ཡོངས་སུ་སྦྱང་བ་བགྱིས་པའོ།
en: Blessed Lord, this sister has indeed undertaken training for the sake of unsurpassed, complete enlightenment!”

source: དགའ་བོ་དེ་དེ་བཞིན་ནོ།
en: Ānanda, it is so!

source: །དགའ་བོ་སྲིང་མོ་འདི་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དོན་དུ་ཡོངས་སུ་སྦྱང་བ་བྱས་པའོ།
en: Ānanda, this sister has trained for the sake of unsurpassed, complete enlightenment.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། གང་གཱའི་ལྷ་མོའི་ལེའུ་སྟེ་བཞི་བཅུ་གསུམ་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: This completes the forty-third chapter, “Gaṅgadevī,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི།
en: Chapter 44 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, how should bodhisattva great beings who practice the perfection of wisdom investigate emptiness?

source: ཇི་ལྟར་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པར་བགྱི།
en: How should they be absorbed in the meditative stability of emptiness?

source: ཇི་ལྟར་མཚན་མ་མེད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི།
en: How should they investigate signlessness?

source: ཇི་ལྟར་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པར་བགྱི།
en: How should they be absorbed in the meditative stability of signlessness?

source: ཇི་ལྟར་སྨོན་པ་མེད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི།
en: How should they investigate wishlessness?

source: ཇི་ལྟར་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པར་བགྱི།
en: How should they be absorbed in the meditative stability of wishlessness?

source: ཇི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི།
en: How should they investigate the four applications of mindfulness?

source: །ཇི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྒོམ་པར་བགྱི།
en: How should they cultivate the four applications of mindfulness?

source: ཇི་ལྟར་ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི།
en: How should they investigate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path?

source: ཇི་ལྟར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པར་བགྱི། ཇི་ལྟར་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: How should they cultivate the noble eightfold path [and those other causal attributes].

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་།
en: How should they investigate the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas?

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི། ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་བསྒོམ་པར་བགྱི།
en: How should they cultivate the eighteen distinct qualities of the buddhas [and those other fruitional attributes]?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་གཟུགས་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who practice the perfection of wisdom should determine that physical forms are empty.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: They should determine that feelings, perceptions, formative predispositions, and consciousness are empty.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: They should determine that the sense fields, the sensory elements, and the links of dependent origination are empty.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: They should determine that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are empty.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: They should determine that [all the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are empty.

source: །འདོད་པའི་ཁམས་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: They should determine that the realm of desire is empty.

source: །གཟུགས་ཡོད་པའི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་སྟོང་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: They should determine that the realm of form and the realm of formlessness are empty.

source: །དེ་ཡང་ཅི་ནས་ཀྱང་དེ་ལྟར་བརྟགས་ན་སེམས་གཡེང་བར་མི་འགྱུར་བ་དེ་ལྟར་བརྟག་པར་བྱ་སྟེ།
en: By whatever means they make such determinations, they should do so with an unwavering mind.

source: དེ་སེམས་མི་གཡེང་བ་དང་ལྡན་པས་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: One whose mind is unwavering does not observe those phenomena.

source: ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་མངོན་དུ་མི་བྱེད་དོ།
en: One who does not observe those phenomena, does not actualize them. {Ki.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་བསླབས་པས་ཆོས་གང་ལ་ཡང་རིས་ཆད་པར་ཡང་མི་བྱེད་དེ། གང་མངོན་དུ་བྱེད་པ་དང་།
en: IV: 193} If you ask why, it is because such bodhisattva great beings will have trained with regard to all phenomena, which are empty of their own defining characteristics.

source: གང་མངོན་དུ་བྱ་བ་དང་གང་གིས་མངོན་དུ་བྱ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not delimit any phenomenon. They do not observe anything that brings into being, anything that is to be brought into being, or anything by which bringing into being takes place.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྟོང་པའི་ཆོས་རྣམས་མངོན་དུ་མི་བྱའོ། །ཞེས་བཀའ་སྩལ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་པ་ཉིད་ལ་གནས་པ། སྟོང་པ་ཉིད་མངོན་དུ་མི་བགྱིད་པ་ལགས།
en: Subhūti then asked, “Blessed Lord, when the Blessed One said that bodhisattva great beings should not actualize phenomena that are empty, how then, Blessed Lord, do bodhisattva great beings dwell in emptiness and not actualize emptiness?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་པ་ཉིད་ལ་རབ་ཏུ་རྟོག་སྟེ་མངོན་དུ་མི་བྱེད་དོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings determine the emptiness endowed with all its finest aspects, they do not think, ‘I actualize it!

source: །མངོན་དུ་བྱའོ་སྙམ་དུ་མི་རྟོག་གོ །
en: I will actualize it!’

source: མངོན་དུ་བྱ་བ་ཡིན་ནོ་ཞེས་བྱ་བར་མི་རྟོག་སྟེ།
en: They do not think, ‘I should actualize it!’

source: ཡོངས་སུ་འདྲིས་པར་བྱ་བར་རྟོག་ཅིང་འདི་ནི་ཡོངས་སུ་འདྲིས་པར་བྱ་བའི་དུས་ཀྱི།
en: Rather, they think, ‘I should thoroughly investigate it.’

source: འདི་ནི་མངོན་དུ་བྱ་བའི་དུས་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རྟོག་གོ །
en: And they think, ‘This is the time for investigation, but this is not the time for actualization.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མཉམ་པར་མ་བཞག་པ་ཉིད་དུ་སེམས་དམིགས་པ་ལ་འདོགས་ཏེ་དེས་བར་མ་དོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལས་ཡོངས་སུ་ཉམ་པར་མི་འགྱུར་ཏེ།
en: Bodhisattva great beings, when not in a state of absorption, focus their minds on perceptual objects and without any interruption on that account do not lapse from the factors conducive to enlightenment.

source: ཟག་པ་ཟད་པ་ཡང་མངོན་དུ་མི་བྱེད་དོ།
en: Yet they do not actualize the state that is free from contaminants.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་ལྟ་བུའི་ཡེ་ཤེས་རླབས་པོ་ཆེ་དང་ལྡན་པ་སྟེ།
en: If you ask why, it is because bodhisattva great beings are endowed with such extensive wisdom.

source: དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་གནས་ཤིང་། འདི་ལྟར་འདི་ནི་ཡོངས་སུ་འདྲིས་པར་བྱ་བའི་དུས་ཏེ། འདི་ནི་མངོན་དུ་བྱ་བའི་དུས་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: They are established in the factors conducive to enlightenment, and know accordingly, ‘This is the time for investigation, not the time for actualization.’ “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེས་འདི་ལྟར་འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་དུས་སོ།
en: Subhūti, bodhisattva great beings who practice the perfection of wisdom should determine, ‘This is the time for the perfection of generosity.

source: །འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དུས་སོ།
en: This is the time for the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །འདི་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བསྒོམ་པའི་དུས་སོ།
en: This is the time for cultivating the applications of mindfulness.

source: །འདི་ནི་ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པའི་དུས་སོ།
en: This is the time for cultivating the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །འདི་ནི་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་བསྒོམ་པའི་དུས་སོ།
en: This is the time for cultivating emptiness, signlessness, and wishlessness.

source: །འདི་ནི་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཐོབ་པར་བྱ་བའི་དུས་སོ།
en: This is the time for acquiring the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཐོབ་པར་བྱ་བའི་དུས་སོ།
en: This is the time for acquiring the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, {Ki.IV: 194} and the eighteen distinct attributes of the buddhas.

source: །འདི་ནི་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པར་བྱ་བའི་དུས་ཡིན་ཏེ།
en: This is the time for acquiring great loving kindness and great compassion.’ “ ‘

source: འདི་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་དུས་མ་ཡིན།
en: However, this is not the time for actualizing the fruit of entering the stream to nirvāṇa.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱ་བའི་དུས་མ་ཡིན།
en: This is not the time for actualizing the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or the fruit of arhatship.

source: རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མངོན་དུ་བྱ་བའི་དུས་མ་ཡིན་ཏེ།
en: This is not the time for actualizing the wisdom of the pratyekabuddhas.

source: འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བ་ཡོངས་སུ་མི་གཏང་བའི་དུས་སོ་ཞེས་བྱ་བར་བརྟག་པར་བྱ་སྟེ།
en: This is the time for acquiring and not relinquishing all-aspect omniscience!’ “

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཅིང་སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་སྤྱོད་པ་ཡིན།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom accordingly, they investigate emptiness and they course through emptiness.

source: མཚན་མ་མེད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཅིང་མཚན་མ་མེད་པས་རྣམ་པར་སྤྱོད་པ་ཡིན།
en: They investigate signlessness and they course through signlessness.

source: སྨོན་པ་མེད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཅིང་སྨོན་པ་མེད་པར་རྣམ་པར་སྤྱོད་པ་ཡིན།
en: They investigate wishlessness and they course through wishlessness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྒོམ་ཞིང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་རྣམ་པར་སྤྱོད་པ་ཡིན།
en: They cultivate the applications of mindfulness and they course through the applications of mindfulness.

source: ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ལ་སྒོམ་ཞིང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱིས་རྣམ་པར་སྤྱོད་པ་ཡིན།
en: They cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, and the branches of enlightenment, and they course through the branches of enlightenment [and so forth].

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྒོམ་ཡང་མངོན་དུ་མི་བྱེད་པ་ཡིན།
en: They cultivate the noble eightfold path, and yet they do not actualize it.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་པ་ཡིན།
en: So it is, Subhūti, that bodhisattva great beings investigate the factors conducive to enlightenment.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སྒོམ་པ་ཡིན།
en: They cultivate the factors conducive to enlightenment.
